tap "fluxcd/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "px4/px4"
brew "aws-sam-cli"
brew "aws-vault"
brew "awscli"
brew "bash-completion"
brew "fastfetch"
brew "figlet"
brew "fzf"
brew "git"
brew "unbound"
brew "libusb"
brew "gnupg"
brew "go"
brew "just"
brew "k9s"
brew "kubeseal"
brew "kustomize"
brew "lolcat"
brew "luarocks"
brew "neovim"
brew "node"
brew "newman"
brew "pnpm"
brew "starship"
brew "stow"
brew "telnet"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "uv"
brew "yarn"
brew "fluxcd/tap/flux"
cask "1password-cli"
cask "chromedriver"
cask "font-fira-code-nerd-font"
cask "font-material-design-icons-webfont"
cask "mitmproxy"
cask "qmk-toolbox"
cask "thunderbird"
cask "wezterm@nightly"
vscode "42crunch.vscode-openapi"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "benjaminbenais.copilot-theme"
vscode "charliermarsh.ruff"
vscode "connor4312.esbuild-problem-matchers"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "harryhopkinson.vim-theme"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "icrawl.discord-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "pmndrs.pmndrs"
vscode "redhat.vscode-yaml"
vscode "skellock.just"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
